// Define the menus
const menu = [
  "ข้าวผัด", "ผัดกะเพรา", "ผัดกะเพรากุ้ง", "ผัดผักบุ้ง", "ไข่เจียว",
  "ลาบหมู", "น้ำตกหมู", "ไข่พะโล้", "เบอร์เกอร์", "พิซซ่า",
  "หมูกรอบผัดพริกเกลือ", "ไก่ทอด", "ราเมง", "ไข่ดาว",
  "KFC", "McDonalds", "Nobicha", "กุ้งอบวุ้นเส้น", "ไข่กระทะ",
  "ข้าวมันไก่", "พาสต้า", "สปาเก็ตตี้คาโบนารา", "สปาเก็ตตี้ผัดขี้เมา",
  "ส้มตำ", "คัตสึด้ง", "ลาซานญ่า", "ทงคัตสึ", "เกี้ยวซ่า",
  "ทาโกะยากิ", "กุ้งเทมปุระ", "ยากิโทริ", "ข้าวขาหมู", "ข้าวแกงกะหรี่",
  "ข้าวหมูแดง", "บะหมี่เกี๊ยว", "ยำวุ้นเส้น", "ปูผัดผงกระหรี่",
  "ต้มยำกุ้ง", "หมูสะเต๊ะ", "ขนมจีน", "ข้าวเหนียวหมูปิ้ง", "ข้าวเกรียบปากหม้อ",
  "ก๋วยเตี๋ยวเรือ", "ข้าวต้ม", "ข้าวพัซซ่า", "ทาร์ตไข่", "ขนมเบื้อง",
  "พิซซ่าหน้าปู", "ข้าวสวย", "กุ้งอบซอส", "ทอดมันปลากราย", "ข้าวผัดปู",
  "สเต๊กเนื้อ", "ชาบู", "ไก่ผัดพริกขี้หนู", "เกาเหลา", "ข้าวผัดกุ้ง",
  "เนื้อย่าง", "หมูย่าง", "ไส้กรอก", "เกาเหลาหมู", "ข้าวคลุกกะปิ",
  "สลัด", "สเต๊กหมู", "แฮมเบอร์เกอร์", "ไก่กรอบ", "แซนด์วิช",
  "คาโบนาร่า", "กุ้งเผา", "ขนมจีนน้ำยา", "ข้าวเกรียบ", "ไข่เจียวหมูสับ",
  "กะเพราหมู", "กะเพราหมูสับ", "ข้าวขาหมู", "ก๋วยจั๊บ", "ผัดไท",
  "หมูชุปแป้งทอด", "กุ้งผัดพริกขี้หนู", "หมูย่างเกาหลี", "สลัดผลไม้",
  "ข้าวผัดสับปะรด", "หมูหัน", "แกงเขียวหวาน", "ข้าวหมูปิ้ง", "ปีกไก่ทอด",
  "ข้าวซอย", "ข้าวต้มปลา", "หมูกรอบ", "ข้าวมันไก่ทอด", "ต้มข่าไก่",
  "ต้มยำปลากระพง", "ลาบไก่", "มักกะโรนี", "หมูปิ้ง", "เนื้อย่าง",
  "ข้าวพะแนง", "ข้าวราดแกง", "ก๋วยเตี๋ยวคั่วไก่", "ก๋วยเตี๋ยวหมู", "ผัดเส้นหมี่",
  "ส้มตำปูปลาร้า", "ข้าวห่อใบบัว", "ยำกุ้งสด", "ไก่ย่าง", "ทอดมันกุ้ง",
  "ข้าวกล่อง", "ข้าวขาหมูโบราณ", "บาร์บีคิว", "หมูตุ๋น", "ไก่ทอดกรอบ",
  "ก๋วยเตี๋ยวต้มยำ", "น้ำพริกปลาทู", "แกงเผ็ดไก่",
  "น้ำตกเนื้อ", "สตูว์เนื้อ", "ไข่ต้ม", "สลัดกุ้ง", "ข้าวผัดกุ้ง",
  "ข้าวปลา", "สตูว์ไก่", "ผัดซีอิ๊ว", "ข้าวพริกหยวก",
  "สลัดปลาแซลมอน", "บะหมี่ไข่", "ข้าวมันไก่ทอดเกาหลี", "ข้าวผัดไข่เค็ม"
];

export function getRandomFood() {
  const index = Math.floor(Math.random() * menu.length);
  return menu[index];
}